Revit 2024 API
PointCollection.GetPointIterator Method
 Creates and returns an iterator for the points contained in this collection.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public PointIterator GetPointIterator()
Visual Basic
Public Function GetPointIterator As PointIterator
Visual C++
public:
PointIterator^ GetPointIterator()
Return Value
 New iterator created, make sure to call 'free' on it when finished using it.
See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace